Repository: Barer/SudokuGraphicCreatorFork
Catalog: SudokuGraphicCreator/SudokuGraphicCreator/Properties/Resources/Resources.*.resx
Languages: cs_cz

source: All
cs_cz: Vše

source: Apply
cs_cz: Použít

source: Booklet informations
cs_cz: Úvodní strana bookletu

# BookletInformationsCategory
source: Optional, example: main, U18 or O50.
cs_cz: Nepovinné, příklad: hlavní, vedlejší.

# BookletInformationsLogoOne
source: Placed in the top left corner of first booklet page.
cs_cz: Umístěné v levém horním rohu.

# BookletInformationsLogoThree
source: Placed in the left bottom corner of first booklet page.
cs_cz: Umístěné v levém dolním rohu.

# BookletInformationsLogoTwo
source: Placed in the top right corner of first booklet page.
cs_cz: Umístěné v pravém horním rohu.

# BookletInformationsOrderNumber
source: Enter number
cs_cz: Zadejte číslo

# BookletInformationsTime
source: Enter time for solving, example: 30 minutes
cs_cz: Zadejte délku kola, příklad: 30 minut

# CalculationProgress
source: The calculation is in progress...
cs_cz: Výpočet probíhá...

source: Cancel
cs_cz: Zrušit

source: Category:
cs_cz: Kategorie:

# ClassicRulesShort
source: Apply classic sudoku rules.
cs_cz: Platí pravidla klasického sudoku.

# ClassicSudokuRules
source: Fill the grid with digits 1 to 9, so that each digit appears once in every row, column and outlined box.
cs_cz: Vyplňte tabulky čísly 1 až 9 tak, aby se stejná čísla neopakovala v každém řádku, sloupci, ani v tučně ohraničených oblastech.

source: Correct format
cs_cz: Správný formát

source: CountOfSolutions
cs_cz: Počet řešení

# CreatingSudokuLabelVariants
source: Variants
cs_cz: Varianty

source: Date:
cs_cz: Datum:

source: Delete
cs_cz: Smazat

source: Delete booklet page
cs_cz: Smazat stranu bookletu

source: Delete sudoku
cs_cz: Smazat sudoku

# DiagonalRules
source: Same digits cannot repeat on the main diagonals.
cs_cz: Navíc se stejná čísla neopakují na vyznačených hlavních diagonálách.

source: Edit booklet
cs_cz: Upravit booklet

source: Edit booklet informations...
cs_cz: Upravit úvodní stranu bookletu...

# ElemArrows
source: Arrows
cs_cz: Šipky

# ElemArrowWithCircle
source: Arrow with circle
cs_cz: Šipka s kolečkem

# ElemBlackCircle
source: Black circle
cs_cz: Černé kolečko

# ElemBoldArrow
source: Bold arrow
cs_cz: Tučná šipka

# ElemCage
source: Cage
cs_cz: Klec

# ElemCharacters
source: Characters
cs_cz: Znaky

# ElemCircle
source: Circle
cs_cz: Kolečko

# ElemCircleWithGreyEdge
source: Circle with grey edge
cs_cz: Kolečko s šedým okrajem

# ElemCircleWithNumber
source: Circle with number
cs_cz: Kolečko s číslem

# ElemGreyCell
source: Grey cell
cs_cz: Šedé políčko

# ElemGreyCircle
source: Grey circle
cs_cz: Šedé kolečko

# ElemGrid
source: Grid
cs_cz: Mřížka

# ElemLine
source: Line
cs_cz: Čára

# ElemLongArrow
source: Long arrow
cs_cz: Dlouhá šipka

# ElemSmallArrow
source: Small arrow
cs_cz: Malá šipka

# ElemSquare
source: Square
cs_cz: Čtverec

# ElemStar
source: Star
cs_cz: Hvězda

# ElemWhiteCircle
source: White circle
cs_cz: Bílé kolečko

source: Export
cs_cz: Exportovat

source: Export solution
cs_cz: Exportovat řešení

source: Filter
cs_cz: Filtrování

source: First sudoku
cs_cz: První sudoku

source: generate all graphic elements
cs_cz: vygenerovat všechny grafické prvky

source: generate solution
cs_cz: vygenerovat řešení

source: Given numbers
cs_cz: Zadaná čísla

# GraphicElemenets
source: Graphic elements:
cs_cz: Grafické prvky

source: Halt
cs_cz: Ukončit

source: Incorrect format
cs_cz: Nesprávný formát

# InformationsForBookletTitle
source: Competition booklet - basic informations
cs_cz: Soutěžní booklet - základní informace

source: Input string
cs_cz: Vstupní řetězec

source: Input strings
cs_cz: Vstupní řetězce

source: Insert given numbers
cs_cz: Vložit zadaná čísla

# InsertionGivenNumberTitle
source: Insertion given numbers
cs_cz: Vložení zadaných čísel

# InsertionGraphicElements
source: Insertion graphic elements and variants
cs_cz: Vložení grafických prvků a variant

source: Insertion of new sudoku table
cs_cz: Vložení nové úlohy

source: Insert new sudoku table
cs_cz: Vložení nové tabulky

source: Insert number
cs_cz: Vložit číslo

source: Insert solution
cs_cz: Vložit řešení

source: Location:
cs_cz: Místo:

# Logo
source: Logo of competition
cs_cz: Logo soutěže:

# MenuAboutApp
source: About app...
cs_cz: O aplikaci...

# MenuCloseAll
source: Close all
cs_cz: Zavřít vše

# MenuConfirmSelection
source: Confirm selection
cs_cz: Potvrdit výběr

# MenuCountOfSolutions
source: Count of solutions...
cs_cz: Počet řešení...

# MenuDeletePage
source: Delete page...
cs_cz: Smazat stranu...

# MenuDeleteSudoku
source: Delete sudoku...
cs_cz: Smazat úlohu...

# MenuDown
source: Down
cs_cz: Dolů

# MenuEdit
source: Edit
cs_cz: Úpravy

# MenuEditBooklet
source: Edit booklet...
cs_cz: Upravit booklet...

# MenuEditSudoku
source: Edit sudoku...
cs_cz: Upravit úlohu...

# MenuEnd
source: Exit
cs_cz: Konec

# MenuExport
source: Export...
cs_cz: Exportovat...

# MenuExportFileWIthSolutions
source: Export file with solutions...
cs_cz: Exportovat soubor s řešením...

# MenuFile
source: _File
cs_cz: _Soubor

# MenuGraphicElements
source: Graphic elements
cs_cz: Grafické prvky

# MenuHelp
source: Help
cs_cz: Nápověda

# MenuInsertElemAndVariants
source: Insert graphic elements and variants...
cs_cz: Vložit grafické prvky a varianty...

# MenuInsertGivenNumbers
source: Insert given numbers...
cs_cz: Vložit zadaná čísla...

# MenuInsertGraphicElem
source: Insert graphic elements...
cs_cz: Vložit grafické prvky...

# MenuInsertGraphicElement
source: Insert graphic element
cs_cz: Vložit grafický prvek

# MenuInsertNewPage
source: Insert new page
cs_cz: Vložit novou stranu

# MenuInsertNewSudoku
source: Insert new sudoku...
cs_cz: Vložit novou úlohu...

# MenuInsertNumber
source: Insert number
cs_cz: Vložit číslo

# MenuInsertSolution
source: Insert solution...
cs_cz: Vložit řešení...

# MenuInsertVariant
source: Insert variant
cs_cz: Vložit variantu

# MenuLeft
source: Left
cs_cz: Vlevo

# MenuLeftDown
source: Down of the left
cs_cz: Vlevo dole

# MenuLeftUp
source: Upper left
cs_cz: Vlevo nahoře

# MenuNew
source: _New
cs_cz: Nový

# MenuNewSize
source: New size...
cs_cz: Nová velikost...

# MenuNewWindow
source: New window
cs_cz: Nové okno

# MenuOpen
source: Open...
cs_cz: Otevřít...

# MenuPanelWithGraphicElements
source: Panel with graphic elements
cs_cz: Panel s grafickými prvky

# MenuPanelWithVariants
source: Panel with variants
cs_cz: Panel s variantami

# MenuRedo
source: Redo
cs_cz: Dopředu

# MenuResetGrid
source: Reset regions
cs_cz: Resetovat oblasti

# MenuResetSelection
source: Reset selection
cs_cz: Resetovat výběr

# MenuRight
source: Right
cs_cz: Vpravo

# MenuRightDown
source: Down of the right
cs_cz: Vpravo dole

# MenuRightUp
source: Upper right
cs_cz: Vpravo nahoře

# MenuSave
source: Save
cs_cz: Uložit

# MenuSaveAs
source: Save as...
cs_cz: Uložit jako...

# MenuSelectRegion
source: Selection of region
cs_cz: Výběr oblasti

# MenuShowHelp
source: Show help...
cs_cz: Zobrazit nápovědu

# MenuSudokuArrowOverCells
source: Sudoku with arrow over cells
cs_cz: Úlohy se šipkou přes políčka

# MenuSudokuCage
source: Sudoku with cages
cs_cz: Úlohy s koši

# MenuSudokuElemenetBetweenTwoCells
source: Sudoku with element between two cells
cs_cz: Úlohy s prvkem mezi dvěma políčky

# MenuSudokuElementInCell
source: Sudoku with element in cell
cs_cz: Úlohy s prvkem v políčku

# MenuSudokuGraphicUnique
source: Sudoku graphic unique
cs_cz: Úlohy graficky unikátní

# MenuSudokuGreyCells
source: Sudoku with grey cells
cs_cz: Úlohy se šedými políčky

# MenuSudokuIrregular
source: Sudoku with irregular grid
cs_cz: Úlohy s nepravidelnou mřížkou

# MenuSudokuLikeClassic
source: Sudoku looking like classic sudoku
cs_cz: Úlohy vypadající jako klasika

# MenuSudokuLineOverCells
source: Sudoku with line over cells
cs_cz: Úlohy s čárou přes políčka

# MenuSudokuNumberAroundGrid
source: Sudoku with numbers around grid
cs_cz: Úlohy s čísly okolo tabulky

# MenuUndo
source: Undo
cs_cz: Zpět

# MenuVariants
source: Variants
cs_cz: Varianty

# MenuView
source: View
cs_cz: Zobrazit

# MenuWindow
source: Window
cs_cz: Okno

source: more
cs_cz: více

source: Name of competition:
cs_cz: Název turnaje:

# NameOfPlayer
source: Name:
cs_cz: Jméno:

source: Name of round:
cs_cz: Název kola:

# NameOfSudoku
source: Name:
cs_cz: Název:

source: New booklet
cs_cz: Nový booklet

source: New page
cs_cz: Nová strana

source: New table
cs_cz: Nová tabulka

source: Number
cs_cz: Číslo

source: Ordinal number of round:
cs_cz: Pořadové číslo kola:

source: Page
cs_cz: Strana

source: point
cs_cz: bod

source: points
cs_cz: bodů

# PointsMiddle
source: points
cs_cz: body

# PointsOfPlayer
source: Total:
cs_cz: Celkem:

# PreviewSolution
source: Solution preview
cs_cz: Náhled řešení

source: round
cs_cz: kolo

# RulesAntiknight
source: Every two cells in the knight step cannot contain the same digit.
cs_cz: Každá dvě políčka na vzdálenost jednoho skoku šachového jezdce musí obsahovat navzájem různá čísla.

# RulesArrows
source: The number in the circle is the sum of all numbers along the corresponding arrow.
cs_cz: Číslo v každém kroužku je součtem všech čísel podél příslušné šipky.

# RulesConsecutive
source: With small circles are marked all pairs of adjacent consecutive numbers.
cs_cz: Malým kroužkem jsou vyznačena všechna místa, kde stranou sousedí dvě po sobě jdoucí čísla.

# RulesDifference
source: The number in a circle tells the difference between the two adjacent numbers.
cs_cz: Malé číslo v kroužku udává rozdíl dvou sousedících čísel.

# RulesDisjointGroups
source: Every 9 cells in the same position in outlined boxes contain numbers 1 to 9.
cs_cz: Každých 9 polí na totožné pozici v rámci vyznačených menších čtverců obsahuje sadu čísel 1 až 9.

# RulesEven
source: Numbers in cells with circles are even.
cs_cz: Čísla v polích s kolečkem jsou sudá.

# RulesExtraRegions
source: Same numbers cannot repeat in grey regions.
cs_cz: Stejná čísla se neopakují ani v šedě podbarvených oblastech.

# RulesGreaterThan
source: All numbers have to comply with given inequality signs.
cs_cz: Vepsaná čísla navíc musí splňovat naznačené nerovnosti.

# RulesIrregular
source: Fill the grid with digits 1 to 9, so that each digit appears once in every row, column and outlined box.
cs_cz: Vyplňte tabulky čísly 1 až 9 tak, aby se stejná čísla neopakovala v každém řádku, sloupci, ani v tučně ohraničených oblastech.

# RulesKiller
source: In the grid are placed cages. For every cage is given the sum of all numbers in the cage. Moreover, numbers in the cage cannot repeat.
cs_cz: V tabulce se nachází koše. Pro každý koš je uveden součet čísel, které v něm leží. Navíc se čísla v jednom koši se neopakují.

# RulesKropki
source: All pairs of two neighboring numbers where one number is double the size of the second number are marked with a black circle. All pairs of two neighboring numbers where their difference is one are marked with a white circle. Between numbers 1 and 2 is placed black circle.
cs_cz: Všechny dvojice sousedících polí, kde jedno číslo je dvojnásobkem druhého, jsou označeny černým kolečkem. Všechny dvojice sousedících polí, kde rozdíl čísel je jedna, jsou označeny bílým kolečkem. Mezi 1 a 2 je uvedeno černé kolečko.

# RulesLittleKiller
source: Same digits cannot repeat on the main diagonals. Numbers around the grid tell the sum of all numbers along the corresponding diagonal in the direction of the arrow. Numbers in these sums can repeat.
cs_cz: Čísla se neopakují na vyznačených hlavních diagonálách. Čísla okolo tabulky udávají součet čísel na dané diagonále ve směru šipky. Sčítaná čísla se mohou opakovat.

# RulesNextToNine
source: Numbers around the grid are neighbours of the number nine in a given row, column. Numbers are given by number size.
cs_cz: Okolo tabulky jsou uvedena čísla, která přímo sousedí s devítkou v daném řádku / sloupci. Čísla jsou uvedena podle velikosti, ne nutně podle pořadí.

# RulesNonconsecutive
source: Every two adjacent cells cannot contain consecutive numbers.
cs_cz: Každá dvě stranou sousedící políčka nesmí obsahovat dvě po sobě jdoucí čísla.

# RulesOdd
source: Numbers in cells with squares are odd.
cs_cz: Čísla v polích se čtverečkem jsou lichá.

# RulesOutside
source: Numbers around the grid are placed among the first three numbers from the edge in the given direction.
cs_cz: Čísla okolo tabulky se vyskytují mezi prvními třemi od okraje z daného směru.

# RulesPalindromes
source: Numbers along the grey lines create palindromes.
cs_cz: Čísla podél šedých čar tvoří palindromy.

# RulesSearchNine
source: Every arrow shows the direction in which the corresponding row or column placed number nine. Moreover, the number in the cell with the arrow tells the count of steps to this nine.
cs_cz: Každá šipka ukazuje směr, kterým se v daném řádku / sloupci nachází devítka. Navíc číslo se šipkou udává počet kroků k této devítce.

# RulesSequences
source: Numbers along the grey lines create sequences. From one end always increases by the same step.
cs_cz: Čísla podél šedých čar tvoří posloupnosti. Z jednoho konce rostou vždy o stejný krok.

# RulesSkyscrapers
source: Numbers in the grid present skyscrapers. Numbers around the grid tell the count of visible skyscrapers in a given direction. A higher skyscraper hides all the lower skyscrapers behind him.
cs_cz: Čísla v tabulce představují mrakodrap příslušné výšky. Čísla okolo tabulky udávají počet viditelných mrakodrapů z daného směru. Vyšší mrakodrap vždy zakrývá všechny nižší za ním.

# RulesStarProduct
source: Numbers around the grid tell the product of all numbers in cells with a star in a given row or column.
cs_cz: Čísla okolo tabulky udávají součin všech čísel v polích s hvězdičkou v daném řádku nebo sloupci.

# RulesSum
source: The number in a circle tells the sum between the two adjacent numbers.
cs_cz: Malé číslo v kroužku udává součet dvou sousedících čísel.

# RulesThermometers
source: Numbers along with the thermometer increase (not necessarily by 1) in the direction from bulb to the opposite end.
cs_cz: Čísla podél vyznačených teploměrů vzrůstají (ne nutně o 1) směrem od kruhové baňky k opačnému konci.

# RulesUntouchable
source: Same numbers cannot touch and not with corners.
cs_cz: Stejná čísla se vzájemně nedotýkají a to ani rohem.

# RulesXVSudoku
source: All pairs of two neighboring numbers with sum 5 are marked with V and all pairs of two neighboring numbers with sum 10 are marked with X.
cs_cz: Všechny dvojice sousedících polí se součtem 5 jsou označeny V, se součtem 10 jsou označeny X.

source: Second sudoku
cs_cz: Druhé sudoku

source: Select file
cs_cz: Vybrat soubor

source: Size of grid
cs_cz: Velikost tabulky

source: Solution:
cs_cz: Řešení:

# SolutionCalculation
source: Calculation of solution
cs_cz: Výpočet počtu řešení

# SolutionPlural
source: solutions
cs_cz: řešení

# SolutionSingular
source: solution
cs_cz: řešení

# StartScreenButtonCreateBooklet
source: Create booklet
cs_cz: Vytvořit booklet

# StartScreenButtonCreateSudoku
source: Create sudoku
cs_cz: Vytvořit sudoku

# StartScreenButtonOpenBooklet
source: Open booklet
cs_cz: Otevřít booklet

# StartScreenButtonOpenSudoku
source: Open sudoku
cs_cz: Otevřít sudoku

# SudokuArrow
source: Arrow Sudoku
cs_cz: Šipky

# SudokuBlackKropki
source: Black Kropki
cs_cz: Černé Kropki

# SudokuClassic
source: Classic sudoku
cs_cz: Klasické sudoku

# SudokuConsecutive
source: Consecutive
cs_cz: Sousledné

# SudokuDiagonal
source: Diagonal
cs_cz: Diagonální

# SudokuDifference
source: Difference
cs_cz: Rozdílovka

# SudokuEven
source: Even
cs_cz: Sudé

# SudokuExtraRegions
source: Extra Regions Sudoku
cs_cz: Extraregiony

# SudokuGreaterThan
source: Greater Than
cs_cz: Srovnávací

source: Sudoku grid:
cs_cz: Tabulka:

source: Sudoku has
cs_cz: Úloha má

# SudokuIrregular
source: Irregular
cs_cz: Nepravidelné

# SudokuLittleKiller
source: Little Killer Sudoku
cs_cz: Zabijáček

# SudokuNextToNine
source: Next To Nine
cs_cz: Vedle devítky

# SudokuNonconsecutive
source: Nonconsecutive
cs_cz: Nesousledné

# SudokuOdd
source: Odd
cs_cz: Liché

# SudokuPalindrome
source: Palindrome
cs_cz: Palindromy

# SudokuPoints
source: Points:
cs_cz: Body:

# SudokuRules
source: Rules:
cs_cz: Zadání:

# SudokuSearchNine
source: Search Nine
cs_cz: Vzdálenost k 9

# SudokuSequence
source: Sequence
cs_cz: Posloupnosti

# SudokuSizeWindowTitle
source: Grid size
cs_cz: Velikost tabulky

# SudokuSkyscrapers
source: Skyscrapers
cs_cz: Mrakodrapy

# SudokuSum
source: Sum
cs_cz: Součtovka

# SudokuThermometer
source: Thermometers
cs_cz: Teploměry

# SudokuUntouchable
source: Untouchable
cs_cz: Bezdotykové

# SudokuWhiteKropki
source: White Kropki
cs_cz: Bílé Kropki

source: Supported sudoku
cs_cz: Podporovaná úloha

source: Time for solving:
cs_cz: Čas na řešení:

source: Total points:
cs_cz: Počet bodů celkem:

source: Type:
cs_cz: Typ:

source: Unsupported sudoku
cs_cz: Nepodporovaná úloha

# WindokuRules
source: Each grey region contains digits 1 to 9.
cs_cz: Navíc vyznačené šedé čtverce obsahují obsahují kompletní sadu 1 až 9.

source: with given numbers
cs_cz: se zadanými čísly

source: without given numbers
cs_cz: bez zadaných čísel
